BaiTian6641/qemu/hw/net/esp32s3_wifi_backend.c
/*
 * ESP32-S3 Wi-Fi Backend — Host network bridge
 *
 * Bridges ESP32-S3 SLC DMA Wi-Fi frames to/from the QEMU host networking
 * stack.  Supports STA, AP, and AP_STA modes with:
 *   • 802.11 ↔ Ethernet frame conversion
 *   • Virtual AP for STA mode (beacon, probe-resp, auth, assoc)
 *   • AP mode data frame bridging
 *   • Concurrent AP_STA operation
 *
 * Copyright (c) 2024-2026 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "qemu/timer.h"
#include "qapi/error.h"
#include "net/net.h"
#include "hw/irq.h"
#include "hw/net/esp32s3_wifi.h"
#include "hw/net/esp32s3_wifi_backend.h"

#define WIFI_BE_DEBUG 0

#if WIFI_BE_DEBUG
#define WIFI_BE_DPRINTF(fmt, ...) \
    qemu_log_mask(LOG_UNIMP, "esp32s3_wifi_be: " fmt, ## __VA_ARGS__)
#else
#define WIFI_BE_DPRINTF(fmt, ...) do {} while (0)
#endif

/* Default virtual AP BSSID (locally-administered) */
static const uint8_t default_vap_bssid[ETH_ALEN] = {
    0x02, 0x00, 0x00, 0x00, 0x00, 0x01
};

/* Default STA MAC (locally-administered, overridden by eFuse/config) */
static const uint8_t default_sta_mac[ETH_ALEN] = {
    0x24, 0x0A, 0xC4, 0x00, 0x00, 0x01
};

/* Default AP MAC */
static const uint8_t default_ap_mac[ETH_ALEN] = {
    0x24, 0x0A, 0xC4, 0x00, 0x00, 0x02
};

/* Supported rates (802.11b/g) for IE construction */
static const uint8_t supported_rates[] = {
    0x82, 0x84, 0x8b, 0x96,  /* 1, 2, 5.5, 11 Mbps (basic) */
    0x0c, 0x12, 0x18, 0x24   /* 6, 9, 12, 18 Mbps */
};
static const uint8_t extended_rates[] = {
    0x30, 0x48, 0x60, 0x6c   /* 24, 36, 48, 54 Mbps */
};

/* Broadcast MAC */
static const uint8_t bcast_mac[ETH_ALEN] = {
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff
};

/* LLC/SNAP header bytes */
static const uint8_t llc_snap_hdr[6] = {
    LLC_SNAP_DSAP, LLC_SNAP_SSAP, LLC_SNAP_CTRL, 0x00, 0x00, 0x00
};

/* ================================================================== */
/*  Utility helpers                                                    */
/* ================================================================== */

static inline uint16_t le16_load(const uint8_t *p)
{
    return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static inline void le16_store(uint8_t *p, uint16_t v)
{
    p[0] = v & 0xff;
    p[1] = (v >> 8) & 0xff;
}

static inline bool is_multicast_mac(const uint8_t *mac)
{
    return (mac[0] & 0x01) != 0;
}

static inline bool is_broadcast_mac(const uint8_t *mac)
{
    return memcmp(mac, bcast_mac, ETH_ALEN) == 0;
}

/* ================================================================== */
/*  802.11 management frame builders                                   */
/* ================================================================== */

/*
 * Build a beacon / probe-response frame body.
 * Returns total frame length including 802.11 header.
 */
static int build_beacon_or_probe_resp(Esp32s3WifiBackend *be,
                                      uint8_t *buf, size_t buf_size,
                                      bool is_probe_resp,
                                      const uint8_t *da)
{
    uint8_t *p = buf;
    int hdr_len = IEEE80211_MGMT_HDR_LEN;

    if (buf_size < (size_t)(hdr_len + 12 + 2 + be->vap.ssid_len +
                            2 + sizeof(supported_rates) +
                            2 + 1 + 2 + sizeof(extended_rates) + 64)) {
        return -1;
    }

    /* --- 802.11 MAC header --- */
    uint16_t fc;
    if (is_probe_resp) {
        fc = IEEE80211_FTYPE_MGMT | IEEE80211_STYPE_PROBE_RESP;
    } else {
        fc = IEEE80211_FTYPE_MGMT | IEEE80211_STYPE_BEACON;
    }
    le16_store(p, fc);    p += 2;              /* Frame Control  */
    le16_store(p, 0);     p += 2;              /* Duration       */
    memcpy(p, da, ETH_ALEN);  p += ETH_ALEN;  /* Addr1 (DA)     */
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN; /* Addr2 (SA=BSSID) */
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN; /* Addr3 (BSSID) */
    /* Sequence control */
    uint16_t seq = (be->vap.seq_num++ & 0x0FFF) << 4;
    le16_store(p, seq);   p += 2;

    /* --- Fixed parameters (12 bytes) --- */
    /* Timestamp (8 bytes) — use virtual clock */
    uint64_t ts = qemu_clock_get_us(QEMU_CLOCK_VIRTUAL);
    memcpy(p, &ts, 8);   p += 8;
    /* Beacon interval (in TU = 1.024 ms) */
    le16_store(p, be->vap.beacon_interval);  p += 2;
    /* Capability info */
    le16_store(p, WLAN_CAPABILITY_ESS);      p += 2;

    /* --- Information Elements --- */
    /* SSID */
    *p++ = WLAN_EID_SSID;
    *p++ = be->vap.ssid_len;
    memcpy(p, be->vap.ssid, be->vap.ssid_len);
    p += be->vap.ssid_len;

    /* Supported Rates */
    *p++ = WLAN_EID_SUPP_RATES;
    *p++ = sizeof(supported_rates);
    memcpy(p, supported_rates, sizeof(supported_rates));
    p += sizeof(supported_rates);

    /* DS Parameter Set (channel) */
    *p++ = WLAN_EID_DS_PARAMS;
    *p++ = 1;
    *p++ = be->vap.channel;

    if (!is_probe_resp) {
        /* TIM (for beacon only — minimal) */
        *p++ = WLAN_EID_TIM;
        *p++ = 4;   /* length */
        *p++ = 0;   /* DTIM count */
        *p++ = 1;   /* DTIM period */
        *p++ = 0;   /* Bitmap control */
        *p++ = 0;   /* Partial virtual bitmap */
    }

    /* Extended Supported Rates */
    *p++ = WLAN_EID_EXT_SUPP_RATES;
    *p++ = sizeof(extended_rates);
    memcpy(p, extended_rates, sizeof(extended_rates));
    p += sizeof(extended_rates);

    return (int)(p - buf);
}

/*
 * Build an authentication response frame.
 * Auth algorithm 0 (Open System), seq 2, status 0 (success).
 */
static int build_auth_response(Esp32s3WifiBackend *be,
                               uint8_t *buf, size_t buf_size,
                               const uint8_t *da)
{
    uint8_t *p = buf;

    if (buf_size < IEEE80211_MGMT_HDR_LEN + 6) {
        return -1;
    }

    /* Header */
    uint16_t fc = IEEE80211_FTYPE_MGMT | IEEE80211_STYPE_AUTH;
    le16_store(p, fc);    p += 2;
    le16_store(p, 0);     p += 2;              /* Duration */
    memcpy(p, da, ETH_ALEN);  p += ETH_ALEN;  /* Addr1 (DA) */
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN;
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN;
    uint16_t seq = (be->vap.seq_num++ & 0x0FFF) << 4;
    le16_store(p, seq);   p += 2;

    /* Body */
    le16_store(p, WLAN_AUTH_OPEN);      p += 2; /* Auth algorithm */
    le16_store(p, 2);                   p += 2; /* Auth seq# 2 (response) */
    le16_store(p, WLAN_STATUS_SUCCESS); p += 2; /* Status code */

    return (int)(p - buf);
}

