BaiTian6641/qemu/hw/net/esp32s3_wifi_backend.c
/*
 * Build an association response frame.
 */
static int build_assoc_response(Esp32s3WifiBackend *be,
                                uint8_t *buf, size_t buf_size,
                                const uint8_t *da,
                                uint16_t aid)
{
    uint8_t *p = buf;

    if (buf_size < IEEE80211_MGMT_HDR_LEN + 6 +
                   2 + sizeof(supported_rates) +
                   2 + sizeof(extended_rates)) {
        return -1;
    }

    /* Header */
    uint16_t fc = IEEE80211_FTYPE_MGMT | IEEE80211_STYPE_ASSOC_RESP;
    le16_store(p, fc);    p += 2;
    le16_store(p, 0);     p += 2;
    memcpy(p, da, ETH_ALEN);  p += ETH_ALEN;
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN;
    memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN;
    uint16_t seq = (be->vap.seq_num++ & 0x0FFF) << 4;
    le16_store(p, seq);   p += 2;

    /* Body */
    le16_store(p, WLAN_CAPABILITY_ESS); p += 2; /* Capability */
    le16_store(p, WLAN_STATUS_SUCCESS); p += 2; /* Status */
    le16_store(p, aid | 0xC000);        p += 2; /* AID (bits 14-15 set) */

    /* Supported Rates */
    *p++ = WLAN_EID_SUPP_RATES;
    *p++ = sizeof(supported_rates);
    memcpy(p, supported_rates, sizeof(supported_rates));
    p += sizeof(supported_rates);

    /* Extended Supported Rates */
    *p++ = WLAN_EID_EXT_SUPP_RATES;
    *p++ = sizeof(extended_rates);
    memcpy(p, extended_rates, sizeof(extended_rates));
    p += sizeof(extended_rates);

    return (int)(p - buf);
}

/* ================================================================== */
/*  802.11 ↔ Ethernet frame conversion                                */
/* ================================================================== */

/*
 * Convert an 802.11 data frame to Ethernet.
 *
 * Input:  802.11 header + LLC/SNAP + payload
 * Output: Ethernet header (DA+SA+EtherType) + payload
 *
 * Returns length of Ethernet frame, or -1 on error.
 */
static int wifi_to_ethernet(const uint8_t *wifi_frame, size_t wifi_len,
                            uint8_t *eth_buf, size_t eth_buf_size)
{
    if (wifi_len < IEEE80211_DATA_HDR_LEN + IEEE80211_LLC_SNAP_LEN) {
        return -1;
    }

    uint16_t fc = le16_load(wifi_frame);
    uint16_t ftype = fc & 0x000C;
    if (ftype != IEEE80211_FTYPE_DATA) {
        return -1;  /* Not a data frame */
    }

    /* Determine header length (QoS adds 2 bytes) */
    int hdr_len = IEEE80211_DATA_HDR_LEN;
    uint16_t stype = fc & 0x00F0;
    if (stype & 0x0080) {
        hdr_len = IEEE80211_QOS_HDR_LEN;
    }

    /* Check ToDS/FromDS to determine address mapping */
    bool to_ds   = (fc & IEEE80211_FCTL_TODS) != 0;
    bool from_ds = (fc & IEEE80211_FCTL_FROMDS) != 0;

    const uint8_t *da, *sa;
    if (!to_ds && !from_ds) {
        /* IBSS: Addr1=DA, Addr2=SA, Addr3=BSSID */
        da = wifi_frame + 4;
        sa = wifi_frame + 10;
    } else if (to_ds && !from_ds) {
        /* STA→AP: Addr1=BSSID, Addr2=SA, Addr3=DA */
        da = wifi_frame + 16;
        sa = wifi_frame + 10;
    } else if (!to_ds && from_ds) {
        /* AP→STA: Addr1=DA, Addr2=BSSID, Addr3=SA */
        da = wifi_frame + 4;
        sa = wifi_frame + 16;
    } else {
        /* WDS (4-addr): Addr1=RA, Addr2=TA, Addr3=DA, Addr4=SA */
        if (wifi_len < (size_t)(hdr_len + 6 + IEEE80211_LLC_SNAP_LEN)) {
            return -1;
        }
        da = wifi_frame + 16;
        sa = wifi_frame + hdr_len;
        hdr_len += 6;  /* Addr4 */
    }

    /* Verify LLC/SNAP header */
    const uint8_t *llc = wifi_frame + hdr_len;
    if (wifi_len < (size_t)(hdr_len + IEEE80211_LLC_SNAP_LEN)) {
        return -1;
    }
    if (llc[0] != LLC_SNAP_DSAP || llc[1] != LLC_SNAP_SSAP ||
        llc[2] != LLC_SNAP_CTRL) {
        /* Not LLC/SNAP — try to handle as raw payload */
        WIFI_BE_DPRINTF("non-LLC/SNAP frame, treating as raw\n");
    }

    /* EtherType is at llc + 6 */
    uint16_t ethertype = ((uint16_t)llc[6] << 8) | llc[7];

    /* Payload starts after LLC/SNAP */
    const uint8_t *payload = wifi_frame + hdr_len + IEEE80211_LLC_SNAP_LEN;
    size_t payload_len = wifi_len - hdr_len - IEEE80211_LLC_SNAP_LEN;

    size_t eth_len = ETH_HLEN + payload_len;
    if (eth_len > eth_buf_size) {
        return -1;
    }

    /* Build Ethernet frame */
    memcpy(eth_buf, da, ETH_ALEN);           /* DA */
    memcpy(eth_buf + ETH_ALEN, sa, ETH_ALEN); /* SA */
    eth_buf[12] = (ethertype >> 8) & 0xff;
    eth_buf[13] = ethertype & 0xff;
    memcpy(eth_buf + ETH_HLEN, payload, payload_len);

    return (int)eth_len;
}

/*
 * Convert an Ethernet frame to an 802.11 data frame.
 *
 * Prepends RX metadata + 802.11 header + LLC/SNAP.
 * The direction flags (ToDS/FromDS) are set based on mode:
 *   STA mode RX: FromDS=1, ToDS=0 (AP→STA)
 *   AP mode RX:  FromDS=0, ToDS=1 (STA→AP)
 *
 * Returns total length (rx_ctrl + 802.11 + LLC/SNAP + payload).
 */
static int ethernet_to_wifi_rx(Esp32s3WifiBackend *be,
                               const uint8_t *eth_frame, size_t eth_len,
                               uint8_t *wifi_buf, size_t wifi_buf_size,
                               bool for_ap_interface)
{
    if (eth_len < ETH_HLEN) {
        return -1;
    }

    const uint8_t *da = eth_frame;
    const uint8_t *sa = eth_frame + ETH_ALEN;
    uint8_t ethertype_hi = eth_frame[12];
    uint8_t ethertype_lo = eth_frame[13];
    const uint8_t *payload = eth_frame + ETH_HLEN;
    size_t payload_len = eth_len - ETH_HLEN;

    size_t total = WIFI_RX_CTRL_SIZE + IEEE80211_DATA_HDR_LEN +
                   IEEE80211_LLC_SNAP_LEN + payload_len;
    if (total > wifi_buf_size) {
        return -1;
    }

    uint8_t *p = wifi_buf;

    /* --- RX metadata (wifi_pkt_rx_ctrl_t) --- */
    memset(p, 0, WIFI_RX_CTRL_SIZE);
    p[0] = (uint8_t)(int8_t)(-30);  /* RSSI = -30 dBm (good signal) */
    p[1] = 0x0B;                    /* rate: 11 Mbps */
    p[20] = be->vap.channel;        /* channel */
    /* sig_len at offset variable — we set frame length below */
    p += WIFI_RX_CTRL_SIZE;

