BaiTian6641/qemu/hw/net/esp32s3_wifi_backend.c
    /* --- 802.11 data frame header --- */
    uint16_t fc = IEEE80211_FTYPE_DATA | IEEE80211_STYPE_DATA;
    if (for_ap_interface) {
        /* Received by our AP: ToDS=1, FromDS=0 */
        fc |= IEEE80211_FCTL_TODS;
        le16_store(p, fc);    p += 2;
        le16_store(p, 0);     p += 2;  /* Duration */
        memcpy(p, be->ap.mac, ETH_ALEN);   p += ETH_ALEN; /* Addr1=BSSID(us) */
        memcpy(p, sa, ETH_ALEN);            p += ETH_ALEN; /* Addr2=SA */
        memcpy(p, da, ETH_ALEN);            p += ETH_ALEN; /* Addr3=DA */
    } else {
        /* Received by our STA: FromDS=1, ToDS=0 */
        fc |= IEEE80211_FCTL_FROMDS;
        le16_store(p, fc);    p += 2;
        le16_store(p, 0);     p += 2;  /* Duration */
        memcpy(p, da, ETH_ALEN);            p += ETH_ALEN; /* Addr1=DA */
        memcpy(p, be->vap.bssid, ETH_ALEN); p += ETH_ALEN; /* Addr2=BSSID */
        memcpy(p, sa, ETH_ALEN);            p += ETH_ALEN; /* Addr3=SA */
    }
    /* Sequence Control */
    uint16_t seq = (be->rx_seq_num++ & 0x0FFF) << 4;
    le16_store(p, seq);  p += 2;

    /* --- LLC/SNAP header --- */
    memcpy(p, llc_snap_hdr, 6);  p += 6;
    *p++ = ethertype_hi;
    *p++ = ethertype_lo;

    /* --- Payload --- */
    memcpy(p, payload, payload_len);
    p += payload_len;

    return (int)(p - wifi_buf);
}

/* ================================================================== */
/*  SLC DMA RX injection                                               */
/* ================================================================== */

/*
 * Inject a pre-built frame (with RX metadata) into SLC0 RX DMA.
 *
 * Walks the RX descriptor chain looking for an HW-owned descriptor
 * with enough buffer space. Writes the frame data, updates length,
 * flips owner to SW, sets EOF, and raises RX_DONE + RX_EOF interrupts.
 */
static int inject_frame_to_slc_rx(Esp32s3WifiBackend *be,
                                  const uint8_t *frame, size_t frame_len)
{
    ESP32S3WifiState *s = be->wifi;

    if (!s || !s->slc0_rx_cur_desc) {
        /* No RX descriptor chain active — try the link register */
        if (s && s->slc0_rx_link) {
            s->slc0_rx_cur_desc = s->slc0_rx_link & SLC_LINK_ADDR_MASK;
        }
        if (!s || !s->slc0_rx_cur_desc) {
            WIFI_BE_DPRINTF("inject_frame: no RX descriptor available\n");
            return 0;
        }
    }

    hwaddr desc_addr = s->slc0_rx_cur_desc;
    int tries = 0;

    while (desc_addr && tries < SLC_DMA_MAX_DESCRIPTORS) {
        uint32_t word0, buf_ptr, next_ptr;

        /* Read descriptor */
        uint32_t desc_buf[3];
        cpu_physical_memory_read(desc_addr, desc_buf, LLDESC_SIZE_BYTES);
        word0    = le32_to_cpu(desc_buf[0]);
        buf_ptr  = le32_to_cpu(desc_buf[1]);
        next_ptr = le32_to_cpu(desc_buf[2]);

        /* Must be HW-owned */
        if (!(word0 & LLDESC_OWNER_MASK)) {
            /* SW owns it — try next */
            if (next_ptr == 0) {
                break;
            }
            desc_addr = next_ptr;
            tries++;
            continue;
        }

        /* Check buffer capacity */
        uint32_t buf_size = word0 & LLDESC_SIZE_MASK;
        if ((size_t)buf_size < frame_len) {
            WIFI_BE_DPRINTF("inject_frame: buffer too small (%u < %zu)\n",
                            buf_size, frame_len);
            /* Try next descriptor */
            if (next_ptr == 0) {
                break;
            }
            desc_addr = next_ptr;
            tries++;
            continue;
        }

        /* Write frame data to descriptor buffer */
        cpu_physical_memory_write(buf_ptr, frame, frame_len);

        /* Update descriptor: set length, set EOF, flip owner to SW */
        word0 &= ~LLDESC_LENGTH_MASK;
        word0 |= ((uint32_t)frame_len << LLDESC_LENGTH_SHIFT) & LLDESC_LENGTH_MASK;
        word0 |= LLDESC_EOF_MASK;
        word0 &= ~LLDESC_OWNER_MASK;  /* SW owned now */

        uint32_t w0_le = cpu_to_le32(word0);
        cpu_physical_memory_write(desc_addr, &w0_le, 4);

        /* Advance to next descriptor for future injections */
        s->slc0_rx_cur_desc = next_ptr;

        /* Raise RX_DONE + RX_EOF interrupts */
        s->slc0_int_raw |= SLC0_INT_RX_DONE | SLC0_INT_RX_EOF;
        esp32s3_wifi_slc_update_irq(s);

        WIFI_BE_DPRINTF("inject_frame: %zu bytes to desc 0x%08" HWADDR_PRIx "\n",
                        frame_len, desc_addr);
        return (int)frame_len;
    }

    WIFI_BE_DPRINTF("inject_frame: no suitable RX descriptor found\n");
    return 0;
}

/* ================================================================== */
/*  Virtual AP management (for STA mode)                               */
/* ================================================================== */

static void vap_beacon_timer_cb(void *opaque)
{
    Esp32s3WifiBackend *be = (Esp32s3WifiBackend *)opaque;

    if (!be->enabled || (be->mode != ESP32S3_WIFI_MODE_STA &&
                         be->mode != ESP32S3_WIFI_MODE_APSTA)) {
        return;
    }

    /* Build and inject a beacon frame */
    uint8_t frame_buf[512];
    int mgmt_len = build_beacon_or_probe_resp(be, frame_buf, sizeof(frame_buf),
                                               false, bcast_mac);
    if (mgmt_len > 0) {
        /* Prepend RX metadata */
        uint8_t rx_buf[WIFI_MAX_FRAME_SIZE];
        memset(rx_buf, 0, WIFI_RX_CTRL_SIZE);
        rx_buf[0] = (uint8_t)(int8_t)(-40);  /* RSSI */
        rx_buf[1] = 0x02;                    /* rate 1 Mbps */
        rx_buf[20] = be->vap.channel;

        if (WIFI_RX_CTRL_SIZE + mgmt_len <= (int)sizeof(rx_buf)) {
            memcpy(rx_buf + WIFI_RX_CTRL_SIZE, frame_buf, mgmt_len);
            inject_frame_to_slc_rx(be, rx_buf, WIFI_RX_CTRL_SIZE + mgmt_len);
            be->mgmt_rx++;
        }
    }

    /* Re-arm timer */
    int64_t interval_ns = (int64_t)be->vap.beacon_interval * 1024 * 1000;
    timer_mod(be->vap.beacon_timer,
              qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + interval_ns);
}

