BaiTian6641/qemu/hw/net/esp32s3_wifi_backend.c
/*
 * Handle an 802.11 management frame from SLC TX DMA.
 * This is a frame the blob is transmitting (e.g., probe-req, auth, assoc-req).
 * Our virtual AP responds appropriately.
 */
static void handle_mgmt_tx_frame(Esp32s3WifiBackend *be,
                                 const uint8_t *frame, size_t len)
{
    if (len < IEEE80211_MGMT_HDR_LEN + 2) {
        return;
    }

    uint16_t fc = le16_load(frame);
    uint16_t stype = fc & 0x00F0;
    const uint8_t *sa = frame + 10;  /* Addr2 = transmitter */

    uint8_t resp_buf[512];
    uint8_t rx_buf[WIFI_MAX_FRAME_SIZE];
    int resp_len = -1;

    be->mgmt_tx++;

    switch (stype) {
    case IEEE80211_STYPE_PROBE_REQ:
        WIFI_BE_DPRINTF("mgmt TX: probe-request from %02x:%02x:%02x:%02x:%02x:%02x\n",
                        sa[0], sa[1], sa[2], sa[3], sa[4], sa[5]);
        resp_len = build_beacon_or_probe_resp(be, resp_buf, sizeof(resp_buf),
                                               true, sa);
        break;

    case IEEE80211_STYPE_AUTH:
        WIFI_BE_DPRINTF("mgmt TX: auth from %02x:%02x:%02x:%02x:%02x:%02x\n",
                        sa[0], sa[1], sa[2], sa[3], sa[4], sa[5]);
        be->sta.assoc_state = WIFI_ASSOC_AUTH;
        resp_len = build_auth_response(be, resp_buf, sizeof(resp_buf), sa);
        break;

    case IEEE80211_STYPE_ASSOC_REQ:
    case IEEE80211_STYPE_REASSOC_REQ:
        WIFI_BE_DPRINTF("mgmt TX: assoc-request from %02x:%02x:%02x:%02x:%02x:%02x\n",
                        sa[0], sa[1], sa[2], sa[3], sa[4], sa[5]);
        be->sta.assoc_state = WIFI_ASSOC_ASSOC;
        be->sta.aid = 1;
        resp_len = build_assoc_response(be, resp_buf, sizeof(resp_buf),
                                         sa, be->sta.aid);
        break;

    case IEEE80211_STYPE_DISASSOC:
    case IEEE80211_STYPE_DEAUTH:
        WIFI_BE_DPRINTF("mgmt TX: deauth/disassoc from STA\n");
        be->sta.assoc_state = WIFI_ASSOC_IDLE;
        be->sta.aid = 0;
        break;

    default:
        WIFI_BE_DPRINTF("mgmt TX: unhandled stype=0x%04x\n", stype);
        break;
    }

    /* Inject response into RX DMA */
    if (resp_len > 0) {
        memset(rx_buf, 0, WIFI_RX_CTRL_SIZE);
        rx_buf[0] = (uint8_t)(int8_t)(-30);
        rx_buf[1] = 0x0B;
        rx_buf[20] = be->vap.channel;

        if (WIFI_RX_CTRL_SIZE + resp_len <= (int)sizeof(rx_buf)) {
            memcpy(rx_buf + WIFI_RX_CTRL_SIZE, resp_buf, resp_len);
            inject_frame_to_slc_rx(be, rx_buf, WIFI_RX_CTRL_SIZE + resp_len);
            be->mgmt_rx++;
        }
    }
}

/* ================================================================== */
/*  SLC TX frame processing                                            */
/* ================================================================== */

void esp32s3_wifi_backend_tx(Esp32s3WifiBackend *be,
                             const uint8_t *buf, size_t len)
{
    if (!be || !be->enabled || len < 2) {
        return;
    }

    uint16_t fc = le16_load(buf);
    uint16_t ftype = fc & 0x000C;

    WIFI_BE_DPRINTF("backend_tx: len=%zu fc=0x%04x type=%u\n",
                    len, fc, ftype >> 2);

    if (ftype == IEEE80211_FTYPE_MGMT) {
        /* Management frame — handle locally for virtual AP */
        if (be->mode == ESP32S3_WIFI_MODE_STA ||
            be->mode == ESP32S3_WIFI_MODE_APSTA) {
            handle_mgmt_tx_frame(be, buf, len);
        }
        return;
    }

    if (ftype != IEEE80211_FTYPE_DATA) {
        /* Control frames are silently consumed */
        return;
    }

    /* Data frame → convert to Ethernet and send via NIC */
    uint8_t eth_buf[WIFI_MAX_FRAME_SIZE];
    int eth_len = wifi_to_ethernet(buf, len, eth_buf, sizeof(eth_buf));

    if (eth_len > 0 && be->nic) {
        qemu_send_packet(qemu_get_queue(be->nic), eth_buf, eth_len);
        be->tx_frames++;
        be->tx_bytes += eth_len;
        WIFI_BE_DPRINTF("backend_tx: sent %d byte Ethernet frame\n", eth_len);
    } else if (eth_len <= 0) {
        /*
         * Fallback: if 802.11 parsing fails, try treating the buffer
         * as a raw Ethernet frame (some blob versions may shortcut).
         */
        if (len >= ETH_HLEN && be->nic) {
            qemu_send_packet(qemu_get_queue(be->nic), buf, len);
            be->tx_frames++;
            be->tx_bytes += len;
            WIFI_BE_DPRINTF("backend_tx: sent %zu bytes as raw Ethernet (fallback)\n",
                            len);
        } else {
            WIFI_BE_DPRINTF("backend_tx: frame conversion failed, dropped\n");
        }
    }
}

/* ================================================================== */
/*  QEMU NIC callbacks (host → guest RX)                               */
/* ================================================================== */

static bool wifi_nic_can_receive(NetClientState *nc)
{
    Esp32s3WifiBackend *be = qemu_get_nic_opaque(nc);
    if (!be || !be->enabled || !be->wifi) {
        return false;
    }

    /* Must have an active RX descriptor chain */
    ESP32S3WifiState *s = be->wifi;
    return (s->slc0_rx_cur_desc != 0 ||
            (s->slc0_rx_link & SLC_LINK_ADDR_MASK) != 0);
}

static ssize_t wifi_nic_receive(NetClientState *nc,
                                const uint8_t *buf, size_t size)
{
    Esp32s3WifiBackend *be = qemu_get_nic_opaque(nc);
    if (!be || !be->enabled) {
        return -1;
    }

    WIFI_BE_DPRINTF("nic_receive: %zu bytes from host\n", size);

    /* Determine which interface receives this frame */
    bool for_ap = false;
    if (be->mode == ESP32S3_WIFI_MODE_AP) {
        for_ap = true;
    } else if (be->mode == ESP32S3_WIFI_MODE_APSTA) {
        /* In AP_STA mode, route based on DA:
         * If DA matches our AP MAC or is broadcast → AP interface
         * Otherwise → STA interface */
        const uint8_t *da = buf;
        if (is_broadcast_mac(da) || is_multicast_mac(da) ||
            memcmp(da, be->ap.mac, ETH_ALEN) == 0) {
            for_ap = true;
        }
    }

    /* Convert Ethernet → 802.11 and inject into SLC RX DMA */
    uint8_t wifi_buf[WIFI_MAX_FRAME_SIZE];
    int wifi_len = ethernet_to_wifi_rx(be, buf, size, wifi_buf, sizeof(wifi_buf),
                                       for_ap);
    if (wifi_len > 0) {
        int injected = inject_frame_to_slc_rx(be, wifi_buf, wifi_len);
        if (injected > 0) {
            be->rx_frames++;
            be->rx_bytes += size;
            return size;
        }
    }

    WIFI_BE_DPRINTF("nic_receive: injection failed\n");
    return -1;
}

