BaiTian6641/qemu/hw/net/esp32s3_wifi_backend.c
static void wifi_nic_link_status_changed(NetClientState *nc)
{
    Esp32s3WifiBackend *be = qemu_get_nic_opaque(nc);
    if (!be) {
        return;
    }

    bool up = !nc->link_down;
    WIFI_BE_DPRINTF("link status changed: %s\n", up ? "UP" : "DOWN");

    if (!up) {
        /* Link went down — deauth STA */
        be->sta.assoc_state = WIFI_ASSOC_IDLE;
    }
}

static NetClientInfo wifi_nic_info = {
    .type = NET_CLIENT_DRIVER_NIC,
    .size = sizeof(NICState),
    .can_receive = wifi_nic_can_receive,
    .receive = wifi_nic_receive,
    .link_status_changed = wifi_nic_link_status_changed,
};

/* ================================================================== */
/*  Public API implementation                                          */
/* ================================================================== */

void esp32s3_wifi_backend_init(ESP32S3WifiState *wifi,
                               Esp32s3WifiBackend *be)
{
    memset(be, 0, sizeof(*be));
    be->wifi = wifi;
    be->mode = ESP32S3_WIFI_MODE_NULL;
    be->enabled = false;

    /* Default MAC addresses */
    memcpy(be->sta.mac, default_sta_mac, ETH_ALEN);
    memcpy(be->ap.mac, default_ap_mac, ETH_ALEN);

    /* Default AP config */
    snprintf(be->ap.ssid, sizeof(be->ap.ssid), "%s", "ESP32S3_AP");
    be->ap.ssid_len = strlen(be->ap.ssid);
    be->ap.channel = WIFI_DEFAULT_CHANNEL;

    /* Virtual AP defaults */
    memcpy(be->vap.bssid, default_vap_bssid, ETH_ALEN);
    snprintf(be->vap.ssid, sizeof(be->vap.ssid), "%s", WIFI_DEFAULT_SSID);
    be->vap.ssid_len = strlen(be->vap.ssid);
    be->vap.channel = WIFI_DEFAULT_CHANNEL;
    be->vap.beacon_interval = 100;  /* 100 TU ≈ 102.4 ms */
    be->vap.seq_num = 0;

    /* Create beacon timer (armed when mode becomes STA/APSTA) */
    be->vap.beacon_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                        vap_beacon_timer_cb, be);
}

void esp32s3_wifi_backend_realize(Esp32s3WifiBackend *be,
                                  DeviceState *dev,
                                  Error **errp)
{
    /* Use the STA MAC as the NIC's MAC address by default */
    memcpy(be->nic_conf.macaddr.a, be->sta.mac, ETH_ALEN);

    be->nic = qemu_new_nic(&wifi_nic_info, &be->nic_conf,
                           object_get_typename(OBJECT(dev)),
                           dev->id,
                           &dev->mem_reentrancy_guard, be);

    if (be->nic) {
        qemu_format_nic_info_str(qemu_get_queue(be->nic),
                                 be->nic_conf.macaddr.a);
        WIFI_BE_DPRINTF("NIC realized, MAC=%02x:%02x:%02x:%02x:%02x:%02x\n",
                        be->sta.mac[0], be->sta.mac[1], be->sta.mac[2],
                        be->sta.mac[3], be->sta.mac[4], be->sta.mac[5]);
    } else {
        qemu_log_mask(LOG_UNIMP,
                      "esp32s3_wifi_be: no NIC created (no network backend)\n");
    }
}

void esp32s3_wifi_backend_reset(Esp32s3WifiBackend *be)
{
    be->mode = ESP32S3_WIFI_MODE_NULL;
    be->enabled = false;

    be->sta.assoc_state = WIFI_ASSOC_IDLE;
    be->sta.aid = 0;

    be->ap.num_stations = 0;
    memset(be->ap.stations, 0, sizeof(be->ap.stations));

    be->vap.seq_num = 0;
    be->rx_seq_num = 0;

    be->tx_frames = 0;
    be->rx_frames = 0;
    be->tx_bytes = 0;
    be->rx_bytes = 0;
    be->mgmt_tx = 0;
    be->mgmt_rx = 0;

    /* Stop beacon timer */
    timer_del(be->vap.beacon_timer);
}

void esp32s3_wifi_backend_set_mode(Esp32s3WifiBackend *be,
                                   Esp32s3WifiMode mode)
{
    Esp32s3WifiMode old_mode = be->mode;
    be->mode = mode;

    WIFI_BE_DPRINTF("mode change: %d → %d\n", old_mode, mode);

    /* Start/stop beacon timer based on mode */
    bool need_beacons = (mode == ESP32S3_WIFI_MODE_STA ||
                         mode == ESP32S3_WIFI_MODE_APSTA);

    if (need_beacons && be->enabled) {
        int64_t interval_ns = (int64_t)be->vap.beacon_interval * 1024 * 1000;
        timer_mod(be->vap.beacon_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + interval_ns);
        WIFI_BE_DPRINTF("beacon timer started (interval=%d TU)\n",
                        be->vap.beacon_interval);
    } else {
        timer_del(be->vap.beacon_timer);
    }

    (void)old_mode;
}

void esp32s3_wifi_backend_set_sta_mac(Esp32s3WifiBackend *be,
                                      const uint8_t mac[ETH_ALEN])
{
    memcpy(be->sta.mac, mac, ETH_ALEN);
    WIFI_BE_DPRINTF("STA MAC set: %02x:%02x:%02x:%02x:%02x:%02x\n",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

    /* Update NIC MAC if available */
    if (be->nic) {
        memcpy(be->nic_conf.macaddr.a, mac, ETH_ALEN);
        qemu_format_nic_info_str(qemu_get_queue(be->nic),
                                be->nic_conf.macaddr.a);
    }
}

void esp32s3_wifi_backend_set_ap_config(Esp32s3WifiBackend *be,
                                        const uint8_t mac[ETH_ALEN],
                                        const char *ssid,
                                        uint8_t ssid_len)
{
    memcpy(be->ap.mac, mac, ETH_ALEN);
    if (ssid_len == 0 && ssid) {
        ssid_len = strlen(ssid);
    }
    if (ssid_len > WIFI_MAX_SSID_LEN) {
        ssid_len = WIFI_MAX_SSID_LEN;
    }
    memcpy(be->ap.ssid, ssid, ssid_len);
    be->ap.ssid[ssid_len] = '\0';
    be->ap.ssid_len = ssid_len;

    WIFI_BE_DPRINTF("AP config: MAC=%02x:%02x:%02x:%02x:%02x:%02x SSID='%s'\n",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
                    be->ap.ssid);
}

bool esp32s3_wifi_backend_can_rx(Esp32s3WifiBackend *be)
{
    if (!be || !be->enabled || !be->wifi) {
        return false;
    }
    return wifi_nic_can_receive(be->nic ?
                                qemu_get_queue(be->nic) : NULL);
}

int esp32s3_wifi_backend_inject_rx(Esp32s3WifiBackend *be,
                                   const uint8_t *buf, size_t len)
{
    if (!be || !be->enabled) {
        return 0;
    }

    bool for_ap = (be->mode == ESP32S3_WIFI_MODE_AP);

    uint8_t wifi_buf[WIFI_MAX_FRAME_SIZE];
    int wifi_len = ethernet_to_wifi_rx(be, buf, len, wifi_buf, sizeof(wifi_buf),
                                       for_ap);
    if (wifi_len > 0) {
        return inject_frame_to_slc_rx(be, wifi_buf, wifi_len);
    }
    return 0;
}

int esp32s3_wifi_backend_inject_mgmt(Esp32s3WifiBackend *be,
                                     const uint8_t *frame, size_t len)
{
    if (!be || !be->enabled) {
        return 0;
    }

    /* Prepend RX metadata */
    uint8_t rx_buf[WIFI_MAX_FRAME_SIZE];
    if (WIFI_RX_CTRL_SIZE + len > sizeof(rx_buf)) {
        return 0;
    }

    memset(rx_buf, 0, WIFI_RX_CTRL_SIZE);
    rx_buf[0] = (uint8_t)(int8_t)(-30);
    rx_buf[1] = 0x0B;
    rx_buf[20] = be->vap.channel;
    memcpy(rx_buf + WIFI_RX_CTRL_SIZE, frame, len);

    return inject_frame_to_slc_rx(be, rx_buf, WIFI_RX_CTRL_SIZE + len);
}

void esp32s3_wifi_backend_set_enabled(Esp32s3WifiBackend *be, bool enable)
{
    be->enabled = enable;
    WIFI_BE_DPRINTF("backend %s\n", enable ? "enabled" : "disabled");

    if (enable && (be->mode == ESP32S3_WIFI_MODE_STA ||
                   be->mode == ESP32S3_WIFI_MODE_APSTA)) {
        /* Start beacon timer */
        int64_t interval_ns = (int64_t)be->vap.beacon_interval * 1024 * 1000;
        timer_mod(be->vap.beacon_timer,
                  qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + interval_ns);
    } else {
        timer_del(be->vap.beacon_timer);
    }
}
